import jieba 
import wordcloud
jieba.add_word('雷迪亚兹')
jieba.add_word('章北海')
jieba.add_word('面壁者')
jieba.add_word('面壁计划')
jieba.add_word('云天明')
jieba.add_word('希恩斯')
jieba.add_word('黑暗森林')
f=open('a.txt','r',encoding='utf-8')
txt=f.read()
f.close()
lst=jieba.lcut(txt)
ex=['没有','一点','不过','部分','当时','一名','那种','一定','重要','目前','摇摇头','得到','随着','说话','来到','形成','完成','第一次','上面','内部','样子','几个','除了','每个','十分','一部分','一只','事情','前面','后面','里面','面前','听到','过程','接着','之前','才能','不要','渐渐','真正','作为','找到','觉得','下面','一条','确实','整个','一般','刚才','主要','首先','变得','三个','之间','还有','一直','看看','这么','不到','大部分','下来','而是','想到','为了','再次','来自','为什么','也许','仍然','时候','感到','于是','告诉','的话','那时','显然','一片','对于','进入','继续','这时','后来','那里','她们','其中','立刻','产生','以后','发生','有人','那样','一下','虽然','正在','肯定','即使','以前','仿佛','所以','地方','出来','完全','不会','不同','变成','许多','认为','其实','处于','不能','周围','一种','同时','存在','人们','那些','当然','能够','任何','发出','甚至','一起','好像','必须','通过','看上去','一切','看着','一次','它们','有些','所有','似乎','成为','一些','那么','像是','然后','感觉','只能','这次','点点头','应该','怎么','很快','因为','由于','真的','其他','好像','几乎','突然','一个','开始','还是','这是','进行','这些','发现','只有','东西','起来','一样','最后','可以','这种','只是','如果','出现','两个','这里','就是','这样','不是','那个','你们','他们','我们','这个','自己','现在','已经','可能','什么','看到','知道']
print(len(ex))
num=len(lst)
for i in range(num):
    if (lst[i] in ex):
        lst[i]=' '
target=' '.join(lst)
w=wordcloud.WordCloud(  font_path='msyh.ttc',\
                      width=1000,height=800,background_color='white',\
                        max_words=100)
w.generate(target)
w.to_file('aaa.png')
    
